# 第5章 データ解析の基礎


##5.3 データの要約
###5.3.1 棒グラフ
Y <- rep ("Y", 180)  # Y を 180 個生成
N <- rep ("N", 120)  # N を 120 個生成		
Y  # Y だけ確認

YN <- c (Y, N)       # Y と N を結合
table (YN)           # 頻度を確認
## YN
##   N   Y 
## 120 180 
barplot(table(YN))  # 棒グラフにしてみる


###5.3.2 ヒストグラム

178.59,181.14,177.6,180.55,178.54,179.32,
180.01,179.44,180.65,181.55,179.2,180.56,
179.9,178.81,179.64,179.63,179.36,178.85,
179.82,182.43,180.47,179.66,181.54,178.98,
180.2,179.87,179.05,179.72,179.34,180.26

x <- c (178.59,181.14,177.6,180.55,178.54,179.32,
       180.01,179.44,180.65,181.55,179.2,180.56,
       179.9,178.81,179.64,179.63,179.36,178.85,
       179.82,182.43,180.47,179.66,181.54,178.98,
       180.2,179.87,179.05,179.72,179.34,180.26)
hist(x)
dev.off ()

###5.3.3 中央値，平均値，最頻値
median(x)

mean (x)

 x [1]
# [1] 178.59
 x [30]
#[1] 180.26
 sum (x)          # 合計
# [1] 5394.68   
 length (x)       # データ数
# [1] 30
sum (x) / length (x)  # 平均値を算出

z <- hist(x)
z

###5.3.4 分散

new.x <- c (183.08,179.6,176.87,180.87,179.95,177.27,
       181.62,176.83,179.45,181.3,175.5,178.22,178.41,
       185.49,180.11,180.11,178.12,180.61,177.25,182.68,
       179.37,180.44,179.61,180.37,176.93,180.82,180.04,
       180.4,181.75,174.56)
mean(new.x)



boxplot(x, new.x, names = c ("x","x.new") )
dev.off ()

sum((x - mean(x))^2 ) / length(x)

var (x)
sum((x - mean(x))^2 ) / (length(x) - 1)

z <- c (40, 50, 60, 70, 80)
mean (z)

sd (x)


##5.4 データの分布
x <- c (178.59,181.14,177.6,180.55,178.54,179.32,
          180.01,179.44,180.65,181.55,179.2,180.56,
          179.9,178.81,179.64,179.63,179.36,178.85,
          179.82,182.43,180.47,179.66,181.54,178.98,
          180.2,179.87,179.05,179.72,179.34,180.26)


par(mfrow = c(2,1))
y <- hist(x)
boxplot(x)
dev.off ()

y

###### コラム：水準ごとの平均
summary (iris)

mean (iris [, -5])

colMeans (iris [, -5])
#sapply (iris [, -5],  mean)

aggregate (iris [, -5],  iris[5], mean)

head (CO2)

tapply (CO2$uptake,  CO2 [c ("Type", "Treatment")],  mean)
#####


##5.5 確率分布とは
###5.5.1 Rによるシミュレーション

(x <- c("表","裏"))
z <- numeric (100)
set.seed (123)
for (i in 1:100){
  y <- sample (x, 10, rep = TRUE)
  z[i] <- sum (y == "表")
}
table (z)


hist (z, breaks = 0:10)
dev.off ()
## set.seed (123)
## z <- sample (x, 10, rep = TRUE)


library (animation)
example (flip.coin)

###5.5.2  二項分布 
choose(10, 3)
choose (10, 3) * 0.5^3 * (1-0.5)^7
dbinom(3, 10, 0.5)


##5.6 確率とデータの関係

coin10 <- dbinom (0:10, 10, 0.5)
plot (0:10, coin10, type = "h", lwd = 5)

dev.off ()

##5.7 確率密度について

x <- c (178.59,181.14,177.6,180.55,178.54,179.32,
       180.01,179.44,180.65,181.55,179.2,180.56,
       179.9,178.81,179.64,179.63,179.36,178.85,
       179.82,182.43,180.47,179.66,181.54,178.98,
       180.2,179.87,179.05,179.72,179.34,180.26)
hist(x)

###5.7.2 正規分布について

dnorm(181, mean = 180, sd = 1)
pnorm(181, mean = 180, sd = 1)
pnorm (181, mean = 180, sd = 1) - pnorm (180, mean = 180, sd = 1)
qnorm (0.8413447, mean = 180, sd = 1)


##5.8 平均値の推定

x <- c (178.59,181.14,177.6,180.55,178.54,179.32,
         180.01,179.44,180.65,181.55,179.2,180.56,
         179.9,178.81,179.64,179.63,179.36,178.85,
         179.82,182.43,180.47,179.66,181.54,178.98,
         180.2,179.87,179.05,179.72,179.34,180.26)
mean (x)
## [1] 179.8227
sd (x)


##### コラム： 母集団と標本
10 - 2 * sqrt ( (10 * (100- 90) ) / 6600)  
##[1] 9.753817
10 + 2 * sqrt ( (10 * (100- 90))  / 6600) 


###5.8.1 平均値の性質

1 / sqrt(30)
c (179.8227 - 0.1825742 * 1.96, 179.8227 + 0.1825742 * 1.96)

example(clt.ani)

##### コラム：t 分布のプロット
 curve (dt(x, 20),-4,4, type="l", lwd = 3, col=1,
		 main = "t 分布はデータ数 N で変化する", ylab = "確率")
 text (1, .4, "N = 20 の場合")
 curve (dt(x, 10),-4,4,type="l", lwd = 3, col=2, add=T)
 text (1.5, .35, "N = 10 の場合", col=2)
 curve (dt(x, 8),-4,4,type="l",lwd = 3,col=3, add=T)
 text (1.8, .3, "N = 8 の場合", col=3)
 curve (dt(x, 2),-4,4,type="l",lwd = 3,col=4, add=T)
 text (2.8, .17, "N =2 の場合", col=4)
 # dnorm()関数で正規分布を重ねます
 curve (dnorm(x), type="l", lty=2, lwd = 3, col=6, add=T)
text (-3, .2, "正規分布", col=6)
 legend (-4, .4, legend = c("N=20","N=10","N=5","N=2", "正規分布"),
          col = c(1:4,6) , lwd = 3, lty = c(1,1,1,1,2))
 text (0, .03, "中央面積が0.95となる場合の")
 text (0, .01, "両端のx軸の値を知りたい")

###5.8.3 母集団の標準偏差が未知の場合
N <- 30
qt (0.975, N - 1 ) # Excel なら tinv(0.05, N-1)
N <- 10
qt (0.975, N - 1 ) 
##[1] 2.262157
c (156 - 2.262 * 14/sqrt(10), 156 + 2.262 * 14/sqrt(10))
## [1] 145.9857 166.0143


###5.8.4 比率の区間推定
c (0.08 - 1.96 * sqrt (0.08 * (1 - 0.08) / 300),
     0.08 + 1.96 * sqrt (0.08 * (1 - 0.08) / 300)) 
